package com.example.museumemotionapp.models

val demographicsQuestions = listOf(
    "Φύλο:",
    "Ηλικία:",
    "Εθνικότητα:",
    "Θρήσκευμα:",
    "Μητρική γλώσσα:",
    "Ποια είναι η γλώσσα που μιλά ο πατέρας σας;",
    "Ποια είναι η γλώσσα που μιλά η μητέρα σας;",
    "Είστε:",
    "Εκπαίδευση και πειθαρχία:",
    "Επάγγελμα:",
    "Έχετε κάποια εξοικείωση με τα εικαστικά;",
    "Έχετε λάβει ποτέ μαθήματα εικαστικής δημιουργίας (μαθήματα γλυπτικής, χαρακτικής, κεραμικής, ελεύθερου ή γραμμικού σχεδίου κλπ);",
    "Επισκέπεστε χώρους τέχνης (εικαστικές εκθέσεις, μουσεία κλπ); Αν ναι, πόσο συχνά;",
    "Έχετε κάποιο αγαπημένο έργο τέχνης; Αν ναι, ποιο είναι αυτό;",
    "Έχετε λάβει ποτέ θεωρητικά μαθήματα ιστορίας της τέχνης; Αν ναι, για πόσο διάστημα;"
)

val genderOptions = listOf("Άνδρας", "Γυναίκα", "Προτιμώ να μην το αναφέρω")
val handednessOptions = listOf("Αριστερόχειρας", "Δεξιόχειρας", "Αμφιδέξιος")
