package com.example.museumemotionapp.questions

val tasQuestions = listOf(
    "Συχνά μπερδεύομαι για το τι συναίσθημα νιώθω.",
    "Μου είναι δύσκολο να βρω τις κατάλληλες λέξεις για τα συναισθήματά μου.",
    "Έχω σωματικές αισθήσεις που ακόμη και οι γιατροί δεν καταλαβαίνουν.",
    "Είμαι σε θέση να περιγράψω εύκολα τα συναισθήματά μου.",
    "Προτιμώ να αναλύω προβλήματα παρά απλώς να τα περιγράφω.",
    "Όταν είμαι αναστατωμένος, δεν ξέρω αν είμαι λυπημένος, φοβισμένος ή θυμωμένος.",
    "Συχνά μπερδεύομαι με τις αισθήσεις στο σώμα μου.",
    "Προτιμώ απλώς να αφήνω τα πράγματα να συμβαίνουν παρά να καταλαβαίνω γιατί έγιναν έτσι.",
    "Έχω συναισθήματα που δεν μπορώ να προσδιορίσω ακριβώς.",
    "Η επαφή με τα συναισθήματα είναι απαραίτητη.",
    "Δυσκολεύομαι να περιγράψω πώς νιώθω για τους ανθρώπους.",
    "Οι άνθρωποι μου λένε να περιγράψω τα συναισθήματά μου περισσότερο.",
    "Δεν ξέρω τι συμβαίνει μέσα μου.",
    "Συχνά δεν ξέρω γιατί είμαι θυμωμένος.",
    "Προτιμώ να μιλάω στους ανθρώπους για τις καθημερινές τους δραστηριότητες παρά για τα συναισθήματά τους.",
    "Προτιμώ να παρακολουθώ «ελαφριές» ψυχαγωγικές εκπομπές παρά ψυχολογικά δράματα.",
    "Μου είναι δύσκολο να αποκαλύψω τα ενδόμυχα συναισθήματά μου, ακόμα και σε στενούς φίλους.",
    "Μπορώ να νιώσω κοντά σε κάποιον, ακόμα και σε στιγμές σιωπής.",
    "Βρίσκω την εξέταση των συναισθημάτων μου χρήσιμη για την επίλυση προσωπικών προβλημάτων.",
    "Η αναζήτηση κρυμμένων νοημάτων σε ταινίες ή έργα αποσπά την προσοχή από την απόλαυσή τους."
)
