package com.example.museumemotionapp.screens

import androidx.compose.runtime.Composable
import androidx.compose.foundation.layout.*
import androidx.compose.foundation.rememberScrollState
import androidx.compose.foundation.verticalScroll
import androidx.compose.material3.*
import androidx.compose.runtime.remember
import androidx.compose.ui.Modifier
import androidx.compose.ui.unit.dp
import androidx.compose.ui.unit.sp
import androidx.compose.ui.text.style.TextAlign
import androidx.navigation.NavController
import com.example.museumemotionapp.LocalFontScale

@Composable
fun ResearchInfoScreen(navController: NavController, username: String) {
    val scale = LocalFontScale.current.scale

    val infoText = remember {
        """
        Έντυπο πληροφόρησης συμμετεχόντων

        Τίτλος: «Ανάλυση εμπειρίας χρήστη κατά την έκθεση σε έργα τέχνης»

        Ερευνητές/τριες:
        
        – Αθηνά Ζώη, Τμήμα: Μηχανικών Πληροφοριακών και Επικοινωνιακών Συστημάτων, Θέση: Φοιτήτρια Προπτυχιακού, Σχέση με Παν/μιο Αιγαίου: Φοιτήτρια Προπτυχιακού, Επιβλέπων: Θεόδωρος Κωστούλας
        – Κωνσταντίνος Κωστούρος, Τμήμα: Μηχανικών Πληροφοριακών και Επικοινωνιακών Συστημάτων, Θέση: Διδακτορικός Φοιτητής, Σχέση με Παν/μιο Αιγαίου: Διδακτορικός Φοιτητής, Επιβλέπων: Θεόδωρος Κωστούλας
        – Μαρία-Καλλιόπη Ντόμπρη, Τμήμα: Μηχανικών Πληροφοριακών και Επικοινωνιακών Συστημάτων, Θέση: Διδακτορική Φοιτήτρια, Σχέση με Παν/μιο Αιγαίου: Διδακτορική Φοιτήτρια, Επιβλέπων: Θεόδωρος Κωστούλας
        – Δημήτριος Δημόπουλος,  Τμήμα: Μηχανικών Πληροφοριακών και Επικοινωνιακών Συστημάτων, Θέση: Διδακτορικός Φοιτητής, Σχέση με Παν/μιο Αιγαίου: Διδακτορικός Φοιτητής, Επιβλέπων: Θεόδωρος Κωστούλας
		
		
		Χρηματοδότηση: Δεν Εφαρμόζεται
		
		
		Έχετε προσκληθεί να συμμετάσχετε σε μία έρευνα που διεξάγεται από Ερευνητική ομάδα του τμήματος Μηχανικών Πληροφοριακών και Επικοινωνιακών Συστημάτων.

		Το έντυπο που κρατάτε στα χέρια σας θα σας δώσει πληροφορίες για την έρευνα προκειμένου να μπορέσετε ενημερωμένα να αποφασίσετε για το αν θα συμμετέχετε ή όχι σε αυτή την έρευνα.
		
		Το έντυπο αυτό θα σας δώσει όλες τις απαραίτητες πληροφορίες που χρειάζεστε προκειμένου να καταλάβετε γιατί γίνεται αυτή η έρευνα και γιατί έχετε προσκληθεί να συμμετάσχετε. Περιγράφει επίσης τι αφορά η συμμετοχή σας, τι πρέπει να κάνετε στο πλαίσιο της έρευνας, καθώς και τυχόν γνωστούς κινδύνους, δυσκολίες ή δυσφορία που μπορεί να προκληθούν κατά τη διάρκεια της συμμετοχής σας. 
		
		Σας παρακαλούμε να αφιερώσετε όσο χρόνο χρειάζεστε για να διαβάσετε το έντυπο, να το σκεφτείτε και να κάνετε όποιες ερωτήσεις θέλετε είτε τώρα είτε κάποια άλλη στιγμή/ανά πάσα στιγμή. Αν αποφασίσετε να συμμετάσχετε, θα σας ζητηθεί να υπογράψετε αυτό το έντυπο και θα λάβετε ένα αντίγραφο.
		
		
		
		1.	ΠΟΙΟΣ ΕΙΝΑΙ Ο ΣΚΟΠΟΣ ΤΗΣ ΕΡΕΥΝΑΣ;
		
		Η ερευνητική μας ομάδα προσπαθεί να καταλάβει πώς νιώθει το άτομο ενώ αλληλοεπιδρά με έργα τέχνης. Πιο συγκεκριμένα, σκοπός αυτής της επιστημονικής έρευνας είναι η κατανόηση των συναισθημάτων που προκαλούνται όταν ένα άτομο παρατηρεί ένα έργο τέχνης και κατά πόσο ένα έργο έχει αφυπνίσει τα αισθητικά συναισθήματα του θεατή. 
		
		
		2.	ΠΟΙΟΣ ΣΥΜΜΕΤΕΧΕΙ ΣΤΗΝ ΕΡΕΥΝΑ; ΓΙΑΤΙ ΕΧΩ ΠΡΟΣΚΛΗΘΕΙ;
		
		Αναζητούμε εθελοντές. Θα χρειαστεί να συμπληρώσετε ένα ερωτηματολόγιο για να βεβαιωθείτε ότι πληροίτε αυτά τα κριτήρια. Πρόσκληση συμμετοχής θα διανεμηθεί εσωτερικά σε φοιτητές Πανεπιστημίων και μέλη του προσωπικού τους, σε ιδιώτες, νομικά πρόσωπα, συλλογικότητες καθώς και σε συνεργαζόμενους με την μελέτη φορείς.  Σε όλους τους ενδιαφερόμενους υποψήφιους θα δοθεί χρόνος για να λάβουν μέρος στη μελέτη. Επιδιώκουμε ο αριθμός των συμμετεχόντων να είναι όσο το δυνατόν μεγαλύτερος.
		
		
		3.	ΜΕ ΠΟΙΟ ΤΡΟΠΟ ΘΑ ΣΥΜΜΕΤΕΧΩ ΣΤΗΝ ΕΡΕΥΝΑ; ΤΙ ΘΑ ΜΟΥ ΖΗΤΗΘΕΙ ΝΑ ΚΑΝΩ;
		
		Το πείραμα περιλαμβάνει μια παρουσίαση έργων τέχνης. Εσείς καλείστε να τα παρατηρήσετε. Θα σας τοποθετήσουμε ορισμένους αισθητήρες οι οποίοι θα μας βοηθήσουν να καταγράψουμε τα συναισθήματα σας κατά την διάρκεια του πειράματος.
		Χρήση αισθητήρων:
		Ως μέρος του πειράματος μας, θα χρησιμοποιήσουμε πολυτροπικούς αισθητήρες και οπτικοακουστικά μέσα ώστε να καταγράψουμε τις αντιδράσεις σας. Στην τρέχουσα μελέτη, θα χρησιμοποιήσουμε έναν ή περισσότερους από τους παρακάτω ανιχνευτές:
		•	Πολυτροπικά δεδομένα (φυσιολογικά και συμπεριφορικά) που συλλέγονται από μη παρεμβατικούς απομονωμένους αισθητήρες (π.χ. ηλεκτροκαρδιογράφημα, ηλεκτροδερμική δραστηριότητα).
		•	Βίντεο: Μέσω μιας συμβατικής κάμερας Η/Υ θα γίνει η καταγραφή των εκφράσεων σας κατά την  έκθεση σας στα έργα τέχνης. Δυνητικά, όλη η διαδικασία του πειράματος μπορεί να βιντεοσκοπηθεί προκειμένου μέρος της να χρησιμοποιηθεί για τις ανάγκες προώθησης και παρουσίασης της έρευνας.
		•	Επιπλέον, θα συμπληρώσετε μια σειρά ερωτηματολογίων, συμπεριλαμβανομένου ενός ερωτηματολογίου προσωπικότητας και ερωτήσεων σχετικά με τα συναισθήματά σας.
		Το όλο πείραμα θα χρειαστεί περίπου 30 λεπτά για να ολοκληρωθεί.
		
		
		4.	ΠΟΙΟΣ ΩΦΕΛΕΙΤΑΙ ΑΠΟ ΤΗΝ ΕΡΕΥΝΑ; Ή ΕΧΩ ΚΑΠΟΙΟ ΟΦΕΛΟΣ ΑΠΟ ΤΗ ΣΥΜΜΕΤΟΧΗ ΜΟΥ ΣΤΗΝ ΕΡΕΥΝΑ;
		
		Δεν υπάρχουν κάποια άμεσα οφέλη για σας από τη συμμετοχή σας στην έρευνα αυτή. Ωστόσο, η συμβολή σας στη μελέτη είναι σημαντική γιατί ελπίζουμε ότι αυτή η εργασία θα βοηθήσει στην καλύτερη κατανόηση του τρόπου με τον οποίο εμπλέκονται τα συναισθήματα του ανθρώπου κατά την παρατήρηση ενός έργου τέχνης. Επίσης, η έρευνα μας ίσως ενισχύσει την αντίληψη της επίδρασης της τέχνης στο κοινωνικό σύνολο. 
		
		
		5.	ΥΠΑΡΧΟΥΝ ΚΙΝΔΥΝΟΙ (Ή ΚΟΣΤΟΣ/ ΕΠΙΒΑΡΥΝΣΗ) ΑΠΟ ΤΗ ΣΥΜΜΕΤΟΧΗ ΜΟΥ ΣΤΗΝ ΕΡΕΥΝΑ;
		
		Δεν γνωρίζουμε αντενδείξεις ή κινδύνους που σχετίζονται με τη χρήση αυτού του εξοπλισμού, όσων αφορά τους αισθητήρες που θα χρησιμοποιήσουμε. Παρόλο που κάποιο αισθητήρες δίνουν πληροφορίες για κάποια ιατρικά σήματα του ατόμου (π.χ. ηλεκτροκαρδιογράφημα), είναι σημαντικό να γνωρίζετε ότι δεν θεωρούνται ιατρικές συσκευές και δεν μπορούν τα δεδομένα να είναι σε θέση να χρησιμοποιηθούν για διάγνωση οποιασδήποτε πιθανής πάθησης.
		Το πείραμα μας συμπεριλαμβάνει την προβολή ορισμένων εικόνων/έργων τέχνης και σχετικών πληροφοριών που ενδέχεται να θεωρηθούν ευαίσθητές ή προκλητικές και δύναται να εκληφθούν ως προσβλητικές από ορισμένους θεατές. Αυτές μπορεί να περιλαμβάνουν:
		•	Εικόνες/έργα τέχνης με θρησκευτικό περιεχόμενο.
		•	Εικόνες/έργα τέχνης με γυμνό περιεχόμενο.
		Σας παρακαλούμε να λάβετε υπόψη σας αυτές τις πιθανές επιπτώσεις κατά τη διάρκεια της συμμετοχής σας στο πείραμα. Η συμμετοχή σας είναι εντελώς προαιρετική και μπορείτε να αποσυρθείτε ανά πάσα στιγμή αν νιώθετε άβολα ή ανασφαλείς σε οποιοδήποτε σημείο της διαδικασίας.
		
		
		6.	ΥΠΟΧΡΕΟΥΜΑΙ ΝΑ ΣΥΜΜΕΤΑΣΧΩ;
		
		Η συμμετοχή σας στην έρευνα είναι απολύτως εθελοντική. Εναπόκειται σε εσάς να αποφασίσετε εάν θα λάβετε μέρος ή όχι. Εάν αποφασίσετε να λάβετε μέρος, θα σας δοθεί το φύλλο πληροφοριών για να το κρατήσετε μαζί με μια φόρμα συμφωνίας συμμετοχής, την οποία θα πρέπει να υπογράψετε. Μπορείτε να αποσυρθείτε κατά τη διάρκεια του πειράματος ανά πάσα στιγμή και χωρίς να αναφέρετε τον λόγο και θα αφαιρέσουμε τυχόν δεδομένα που συλλέγονται για εσάς από τη μελέτη. Μόλις ολοκληρωθεί το πείραμα, μπορείτε ακόμα να αποσύρετε τα αρχικά δεδομένα σας όποτε εσείς επιθυμείτε. Το να αποφασίσετε να συμμετάσχετε ή όχι δεν θα έχει καμία συνέπεια ή αντίκτυπο σε εσάς ή την επαγγελματική/εκπαιδευτική σας κατάσταση.
		
		
		7.	ΠΩΣ ΘΑ ΔΙΑΦΥΛΑΧΘΕΙ Η ΙΔΙΩΤΙΚΟΤΗΤΑ ΜΟΥ;
		
		1. Στο πλαίσιο της έρευνας στην οποία καλείστε να λάβετε μέρος θα συγκεντρώσουμε τα παρακάτω δεδομένα που αφορούν το πρόσωπό σας:
		Ονοματεπώνυμο, Ηλικία, Στοιχεία επικοινωνίας, Επάγγελμα, Εθνικότητα, Φύλο, Στοιχεία που αφορούν την προσωπικότητά σας. Τα πλήρη ερωτηματολόγια θα είναι στη διάθεσή σας προκειμένου να τα μελετήσετε. 
		Σχετικά με τα σήματα φυσιολογίας θα συλλέξουμε τις πληροφορίες που θα μας δώσετε με τη χρήση ερωτηματολογίων, πολυτροπικών αισθητήρων και βίντεο:
		Θα καταγράψουμε δεδομένα από εσάς τα οποία σχετίζονται με τα συναισθήματα σας. Ανάμεσα στους αισθητήρες που θα χρησιμοποιηθούν θα ελέγξουμε την αγωγιμότητα του δέρματος σας (ηλεκτροδερμική δραστηριότητα) καθώς κάποια συναισθήματα εκφράζονται μέσω της εφίδρωσης. Επίσης, με την χρήση του ηλεκτροκαρδιογραφήματος θα μπορέσουμε να καταλάβουμε, ίσως, τον θαυμασμό, την έκπληξη, γενικά πιο έντονα συναισθήματα. Τέλος, θα σας ζητήσουμε να απαντήσετε ερωτηματολόγια σχετικά με την προσωπικότητα και τα συναισθήματά σας. Αυτό γίνεται για να κατανοήσουμε καλύτερα πώς τα δεδομένα που θα συλλέξουμε ταιριάζουν με τις απαντήσεις σας. Τα δεδομένα αυτά είναι απαραίτητα προκειμένου να μας βοηθήσετε να έχουμε όσο το δυνατόν πιο άρτια αποτελέσματα για την έρευνα μας. 
		
		2. Οι πληροφορίες που θα μας δώσετε θα ανωνυμοποιηθούν με τέτοιο τρόπο ώστε να μην είναι δυνατόν να αποκαλυφθεί η ταυτότητά σας σε τρίτους. Επίσης, η ταυτότητά σας δεν θα αποκαλυφθεί σε πιθανές δημοσιεύσεις, παρουσιάσεις ή επιστημονικές αναφορές που θα προκύψουν από τη συγκεκριμένη μελέτη, εκτός αν έχετε δώσει ρητή συγκατάθεση. 
		
		3. Τα αρχεία που περιλαμβάνουν τα δεδομένα σας θα φυλάσσονται σε ασφαλή τοποθεσία, όπως επίσης σε ασφαλές δίκτυο με κωδικό πρόσβασης και κρυπτογράφηση όπου θα φυλάσσονται ηλεκτρονικά. Όλα τα ηλεκτρονικά αρχεία (συμπεριλαμβανομένων όλων των τύπων ηλεκτρονικών αρχείων που χρησιμοποιούνται, όπως βάσεις δεδομένων, υπολογιστικά φύλλα κ.λπ.) που περιέχουν αναγνωρίσιμες πληροφορίες θα προστατεύονται με κωδικό πρόσβασης. Οποιοσδήποτε υπολογιστής φιλοξενεί τέτοια αρχεία θα έχει επίσης προστασία με κωδικό πρόσβασης για να εμποδίσει την πρόσβαση από μη εξουσιοδοτημένους χρήστες. Μόνο τα μέλη της ερευνητικής ομάδας θα έχουν κωδικούς πρόσβασης.
		Τα αρχεία της έρευνας/δεδομένα που αφορούν το πρόσωπό σας θα φυλαχθούν τουλάχιστον για το χρονικό διάστημα  03/2024 έως 12/2030.
		
		4. Εάν αποσυρθείτε από την ενεργό συμμετοχή στη μελέτη, δεν θα κρατήσουμε καμία πληροφορία σχετικά με εσάς. Όλα τα δεδομένα που μπορούν να συνδεθούν με την δική σας συμμετοχή ή να χρησιμοποιηθούν για την ταυτοποίησή σας θα διαγραφούν. Σημειώστε ότι αν έχουν εκπαιδευτεί αλγόριθμοι η δημοσιοποιηθεί δείγματα δεδομένων σας η απόσυρση της σχετικής πληροφορίας που έχει χρησιμοποιηθεί ίσως να μην είναι δυνατή.
		
		
		8.	ΠΟΙΟΣ ΧΡΗΜΑΤΟΔΟΤΕΙ ΤΗΝ ΕΡΕΥΝΑ;
		
		Η έρευνα αυτή υποστηρίζεται από το Πανεπιστήμιο Αιγαίου και πιο συγκεκριμένα από το τμήμα Μηχανικών Πληροφοριακών και Επικοινωνιακών Συστημάτων» 
		
		
		9.	 ΠΟΙΟΣ ΕΧΕΙ ΕΓΚΡΙΝΕΙ ΑΥΤΗ ΤΗΝ ΕΡΕΥΝΑ;
		
		«Η έρευνα έχει λάβει έγκριση από την Επιτροπή Ηθικής και Δεοντολογίας του Πανεπιστημίου Αιγαίου με αρ 30/04.03.2025»
		
		10.	ΜΕ ΠΟΙΟΝ ΜΠΟΡΩ ΝΑ ΕΠΙΚΟΙΝΩΝΗΣΩ ΓΙΑ ΠΕΡΙΣΣΟΤΕΡΕΣ ΠΛΗΡΟΦΟΡΙΕΣ ΓΙΑ ΤΗΝ ΕΡΕΥΝΑ
		
		Για περισσότερες πληροφορίες σχετικά με την έρευνα μπορείτε να επικοινωνήσετε με :
		Αθηνά Ζώη,  icsd18250@aegean.gr
		Κωνσταντίνος Κωστούρος, icsdd23009@icsd.aegean.gr 
		Θεόδωρος Κωστούλας, theodoros.kostoulas@aegean.gr 
		
		11.	ΠΟΥ ΜΠΟΡΩ ΝΑ ΥΠΟΒΑΛΩ ΠΑΡΑΠΟΝΑ Η ΚΑΤΑΓΓΕΛΙΕΣ;
		
		Για οποιαδήποτε παράπονα ή καταγγελίες σχετικά με τη διεξαγωγή της έρευνας μπορείτε να προσφύγετε στην Επιτροπή Ηθικής και Δεοντολογίας του Πανεπιστημίου Αιγαίου ethics@aegean.gr
		Για οποιαδήποτε καταγγελία σχετικά με τη διαχείριση των προσωπικών σας δεδομένων μπορείτε να απευθύνεστε στην/ον Υπεύθυνη/ο Επεξεργασίας Προσωπικών Δεδομένων του Πανεπιστημίου Αιγαίου (dpo@aegean.gr) και σε κάθε περίπτωση στην Αρχή Προστασίας Δεδομένων Προσωπικού Χαρακτήρα (complaints@dpa.gr)

        """.trimIndent()
    }

    Column(
        modifier = Modifier
            .fillMaxSize()
            .padding(16.dp)
            .verticalScroll(rememberScrollState())
    ) {
        Text(
            text = "Πληροφορίες για την Έρευνα",
            fontSize = 20.sp * scale,
            textAlign = TextAlign.Center,
            modifier = Modifier.fillMaxWidth()
        )

        Spacer(modifier = Modifier.height(16.dp))

        Text(
            text = infoText,
            fontSize = 14.sp * scale,
            textAlign = TextAlign.Start
        )

        Spacer(modifier = Modifier.height(24.dp))

        Button(onClick = { navController.popBackStack() }) {
            Text("🔙 Επιστροφή", fontSize = 16.sp * scale)
        }
    }
}

